Enterprise_Serivces/Cert/SilverGroup2/LoyaltyChannel/result1/Iteration1/t7_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/channel/loyalty/contracts/2010/05/LoyaltyService/GetComplexRecommendation</wsa:Action><wsa:MessageID>uuid:a1e23ac2-4eea-4cf7-b1b7-9f892e19be68</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://loyaltychannelqa1.testgs.pvt/LoyaltyService.svc</wsa:To></soap:Header><soap:Body><GetComplexRecommendation xmlns="http://www.gamestop.com/services/channel/loyalty/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><Age xmlns="http://www.gamestop.com/services/channel/loyalty/messages/2010/05">21</Age><CustomerID xmlns="http://www.gamestop.com/services/channel/loyalty/messages/2010/05">123456789</CustomerID><MaxEsrbRating xmlns="http://www.gamestop.com/services/channel/loyalty/messages/2010/05">M</MaxEsrbRating></request></GetComplexRecommendation></soap:Body></soap:Envelope>